КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиКонвертацииСправочников/КонтурЛогистика_НастройкиКонвертацииСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_НастройкиКонвертацииСправочников</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыНастроекКонвертаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСправочникаИлиДокументаУС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСправочникаЛогистика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитТитула</name>
    <comment>если не указан - для всех прикладных сущностей соответствующих указанному ТипСправочникаЛогистика</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьРеквизитыИзУчетнойСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеКонвертации</name>
    <type>
      <types>EnumRef.КонтурЛогистика_НаправлениеКонвертации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьЭлементСправочникаУчетнойСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаКонвертации</name>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаТипЗначения</name>
      <comment>какого типа этот заполняемый реквизит</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
        <types>EnumRef.КонтурЛогистика_ВидыКонтактнойИнформации</types>
        <types>Boolean</types>
        <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
        <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
        <types>String</types>
        <types>CatalogRef.КонтурЛогистика_Договоры</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
        <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаКомментарий</name>
      <comment>для того чтобы разъяснить пользователю особенности этого реквизита</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособМаппинга</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыМаппингаПоля</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления</name>
      <comment>как вычислять. Для маппинга доп свойств - указывается как получить реквизит, чье доп свойство требуется вычислить</comment>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючДопСвойстваРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления2</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособКонвертацииЗначения</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыКонвертации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновитьИзУчетнойСистемы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияСтрокаНеогр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КонвертироватьПоНастройке</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииСправочников</types>
      </type>
    </attributes>
    <attributes>
      <name>СвойствоОбъекта</name>
      <comment>Код свойства объекта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаСоответствий</name>
    <attributes>
      <name>РеквизитСправочникаЛогистика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзвлеченноеЗначение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ВсеСправочникиУчетнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособМаппинга</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыМаппингаПоля</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления</name>
      <comment>как вычислять. Для маппинга доп свойств - указывается как получить реквизит, чье доп свойство требуется вычислить</comment>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаОбратнойКонвертации</name>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаТипЗначения</name>
      <comment>какого типа этот заполняемый реквизит</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
        <types>EnumRef.КонтурЛогистика_ВидыКонтактнойИнформации</types>
        <types>Boolean</types>
        <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
        <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
        <types>String</types>
        <types>CatalogRef.КонтурЛогистика_Договоры</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
        <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитСправочникаЛогистикаКомментарий</name>
      <comment>для того чтобы разъяснить пользователю особенности этого реквизита</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособМаппинга</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыМаппингаПоля</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления</name>
      <comment>как вычислять. Для маппинга доп свойств - указывается как получить реквизит, чье доп свойство требуется вычислить</comment>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючДопСвойстваРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления2</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособКонвертацииЗначения</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыКонвертации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновитьИзУчетнойСистемы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияСтрокаНеогр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КонвертироватьПоНастройке</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииСправочников</types>
      </type>
    </attributes>
    <attributes>
      <name>СвойствоОбъекта</name>
      <comment>Код свойства объекта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаполнениеСпрУчСист</name>
    <attributes>
      <name>ТипАлгоритма</name>
      <type>
        <types>EnumRef.КонтурЛогистика_АлгоритмыЗаполнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчета</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисления</name>
      <comment>как вычислять. Для маппинга доп свойств - указывается как получить реквизит, чье доп свойство требуется вычислить</comment>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияСтрокаНеогр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КонвертироватьПоНастройке</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииСправочников</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеВычисленияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбновитьИзДокУчСист</name>
      <comment>Обновлять значение реквизита, даже если оно уже заполнено</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючевоеПоле</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Скрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыНастроекКонвертаций/КонтурЛогистика_ТипыНастроекКонвертаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыНастроекКонвертаций</name>
  <enumValues>
    <name>Основная</name>
  </enumValues>
  <enumValues>
    <name>Расширенная</name>
  </enumValues>
  <enumValues>
    <name>Замещающая</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиКонвертацииСправочников/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// проверка наименования
	Если Не Наименование = Ссылка.Наименование И Не ПометкаУдаления Тогда 
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтурЛогистика_НастройкиКонвертацииСправочников.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников
			|ГДЕ
			|	КонтурЛогистика_НастройкиКонвертацииСправочников.Наименование = &Наименование
			|	И НЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Наименование", Наименование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			Сообщить("Укажите другое наименование. В базе уже есть настройка конвертации справочников с наименованием: " + Наименование);
			Отказ = Истина;
		КонецЕсли;	
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Тип) Тогда
		Тип = Перечисления.КонтурЛогистика_ТипыНастроекКонвертаций.Замещающая;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
